Reports/фин_АнализСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>фин_АнализСчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.фин_Бюджетирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯзыкОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯзыкиНародовМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСубсчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКорСчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКорСубконто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_РесурсыДанныхБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Группировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ДополнительныеРазрезыОтчетов</v8:Type>
								<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccountingRegisters/фин_Бюджетирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>фин_Бюджетирование</Name>
			<Comment>(Упр)</Comment>
			<ChartOfAccounts>ChartOfAccounts.фин_Бюджетирование</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.фин_Бюджетирование.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.фин_Бюджетирование.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.фин_Бюджетирование.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценария</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Comment>Сумма оценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/усд_ВидыСравненияДляУсловий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>усд_ВидыСравненияДляУсловий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Равно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Больше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БольшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Меньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеньшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИнтервале</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИнтервалеВключаяГраницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСпискеПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВСпискеПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗаполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_ФактическиеПоказателиБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ФактическиеПоказателиБюджетирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправленческоеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Валюта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сценарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодПланирования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_РесурсыДанныхБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_РесурсыДанныхБюджетирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаУпр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютнаяСумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаСценария</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦенаУпр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютнаяЦена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦенаСценария</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/фин_АнализСчета/Ext/ObjectModule.bsl
Перем ЗаполнениеПараметров Экспорт;
Перем СохраненнаяНастройка Экспорт;
Перем ДополнительныеПараметры Экспорт;
Перем ПараметрыОформления Экспорт;
Перем СтруктураПеревода;
Перем КЭШ;
Перем ДоступныеПоказатели Экспорт;
Перем ДоступныеГруппировки Экспорт;
Перем ПереченьОсновныхРеквизитов Экспорт;
Перем ДополнительныеПредставления Экспорт;
Перем ДанныеРасшифровки Экспорт;
Перем ОтборыРасшифровки Экспорт;
Перем ТаблицаОтбора Экспорт;

Процедура Скомпоновать(ДокументРезультат,Отбор) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран счет! Отчет не сформирован");
		Возврат;
	КонецЕсли;
	Если Показатели.Количество()=0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны показатели отчета! Отчет не сформирован");
		Возврат;
	КонецЕсли;
	
	ТекстФильтрОстатки = "";
	МассивСубконто = Новый Массив;
	
	Для Каждого СтрокаОтбор Из Отбор Цикл
		Если СтрокаОтбор.ВидСравнения.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		ТекстУсловия = " = &ПараметрОтбора"+Строка(Отбор.Индекс(СтрокаОтбор));
		Если СтрокаОтбор.ВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.ВСписке Тогда
			ТекстУсловия = " В (&ПараметрОтбора"+Строка(Отбор.Индекс(СтрокаОтбор))+")";
		ИначеЕсли СтрокаОтбор.ВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.НеВСписке  Тогда
			ТекстУсловия = " НЕ В (&ПараметрОтбора"+Строка(Отбор.Индекс(СтрокаОтбор))+")";
		ИначеЕсли СтрокаОтбор.ВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.ВСпискеПоИерархии ИЛИ СтрокаОтбор.ВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.ВИерархии  Тогда
			ТекстУсловия = " В ИЕРАРХИИ (&ПараметрОтбора"+Строка(Отбор.Индекс(СтрокаОтбор))+")";
		ИначеЕсли СтрокаОтбор.ВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.НеВСпискеПоИерархии ИЛи СтрокаОтбор.ВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.НеВИерархии  Тогда
			ТекстУсловия = " НЕ В ИЕРАРХИИ (&ПараметрОтбора"+Строка(Отбор.Индекс(СтрокаОтбор))+")";
		ИначеЕсли СтрокаОтбор.ВидСравнения = Перечисления.усд_ВидыСравненияДляУсловий.НеРавно  Тогда
			ТекстУсловия = " <> &ПараметрОтбора"+Строка(Отбор.Индекс(СтрокаОтбор));
		КонецЕсли;
		Если СтрокаОтбор.ПолеОтбора = Перечисления.фин_ФактическиеПоказателиБюджетирования.Валюта Тогда
			ТекстФильтрОстатки = ТекстФильтрОстатки + ?(ТекстФильтрОстатки="",""," И ") +"Валюта "+ТекстУсловия;
		ИначеЕсли СтрокаОтбор.ПолеОтбора = Перечисления.фин_ФактическиеПоказателиБюджетирования.Организация Тогда
			ТекстФильтрОстатки = ТекстФильтрОстатки + ?(ТекстФильтрОстатки="",""," И ") +"Организация "+ТекстУсловия;
		Иначе
			НомерСубконто = 0;
			Разрез = фин_РаботаСДополнительнымиРазрезамиБюджетирования.РазрезПоИзмерению(СтрокаОтбор.ПолеОтбора);
			Если МассивСубконто.Найти(Разрез)=Неопределено Тогда
				МассивСубконто.Добавить(Разрез);
				НомерСубконто = МассивСубконто.Количество();
			Иначе
				НомерСубконто = МассивСубконто.Найти(Разрез)+1;
			КонецЕсли;
			ТекстФильтрОстатки = ТекстФильтрОстатки + ?(ТекстФильтрОстатки="",""," И ") +"Субконто"+Строка(НомерСубконто)+" "+ТекстУсловия;
		КонецЕсли;
	КонецЦикла;
	
	СоответствиеПолейИзмерениям = Новый Соответствие;
	ДополнительныеПоля = Новый Массив;
	ГруппировочныеПоля = Новый Массив;
	Для Каждого Группировка Из Группировки Цикл
		СтрокиГрупп = Группировки.НайтиСтроки(Новый Структура("Измерение",Группировка.Измерение));
		Если СтрокиГрупп.Количество()>1 Тогда
			Если Группировка <> СтрокиГрупп[0] Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если Группировка.Измерение=Перечисления.фин_ФактическиеПоказателиБюджетирования.Валюта
			ИЛИ Группировка.Измерение=Перечисления.фин_ФактическиеПоказателиБюджетирования.Организация Тогда
			ДополнительныеПоля.Добавить(фин_ОбщегоНазначенияСервер.ПолучитьИмяЭлементаПеречисленияПоЗначению(Группировка.Измерение));
			ГруппировочныеПоля.Добавить(фин_ОбщегоНазначенияСервер.ПолучитьИмяЭлементаПеречисленияПоЗначению(Группировка.Измерение));
		Иначе
			НомерСубконто = 0;
			Разрез = фин_РаботаСДополнительнымиРазрезамиБюджетирования.РазрезПоИзмерению(Группировка.Измерение);
			Если МассивСубконто.Найти(Разрез)=Неопределено Тогда
				МассивСубконто.Добавить(Разрез);
				НомерСубконто = МассивСубконто.Количество();
			Иначе
				НомерСубконто = МассивСубконто.Найти(Разрез)+1;
			КонецЕсли;
			ГруппировочныеПоля.Добавить("Субконто"+Строка(НомерСубконто));
			СоответствиеПолейИзмерениям.Вставить("Субконто"+Строка(НомерСубконто),Группировка.Измерение);
		КонецЕсли;
	КонецЦикла;
	
	Для Инд = 1 По МассивСубконто.Количество() Цикл
		ДополнительныеПоля.Добавить("Субконто"+Строка(Инд));
	КонецЦикла;
	
	СхемаКомпоновкиДанных.СвязиНаборовДанных.Очистить();
	Связь = СхемаКомпоновкиДанных.СвязиНаборовДанных.Добавить();
	Связь.ВыражениеИсточник="Счет";
	Связь.ВыражениеПриемник="Счет";
	Связь.НаборДанныхИсточник="Остатки";
	Связь.НаборДанныхПриемник="Обороты";
	Связь.Обязательная=Истина;
	Связь = СхемаКомпоновкиДанных.СвязиНаборовДанных.Добавить();
	Связь.ВыражениеИсточник="Период";
	Связь.ВыражениеПриемник="Период";
	Связь.НаборДанныхИсточник="Остатки";
	Связь.НаборДанныхПриемник="Обороты";
	Связь.Обязательная=Истина;
	Для Каждого ДополнительноеПоле Из ДополнительныеПоля Цикл
		Связь = СхемаКомпоновкиДанных.СвязиНаборовДанных.Добавить();
		Связь.ВыражениеИсточник=ДополнительноеПоле;
		Связь.ВыражениеПриемник=ДополнительноеПоле;
		Связь.НаборДанныхИсточник="Остатки";
		Связь.НаборДанныхПриемник="Обороты";
		Связь.Обязательная=Истина;
	КонецЦикла;

	// установка текста условия в текст запроса
	СхемаКомпоновкиДанных.НаборыДанных["Остатки"].Запрос = ТекстЗапросаОстатки(ТекстФильтрОстатки,МассивСубконто,ДополнительныеПоля);
	СхемаКомпоновкиДанных.НаборыДанных["Обороты"].Запрос = ТекстЗапросаОбороты(ТекстФильтрОстатки,МассивСубконто,ДополнительныеПоля);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	//СхемаКомпоновкиДанных.МакетыГруппировок.Очистить();
	НомерМакета = 1;
	Если ЗначениеЗаполнено(ПериодичностьОтчета) Тогда
		СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("Период").ВыражениеПредставления = "фин_УправлениеОтчетамиБюджетирование.ПредставлениеПериодаСтрокойНаЯзыке(Период,&Периодичность,&ЯзыкОтчета)";
		//НовыйМакет = СхемаКомпоновкиДанных.МакетыГруппировок.Добавить();
		//НовыйМакет.ИмяГруппировки = "";
		//НовыйМакет.Макет = "R46C1:R49C5";
		//НовыйМакет.ПоляГруппировки.Добавить(Новый ПолеКомпоновкиДанных("Период"));
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КонецЕсли;
	//установа параметров запроса
	Если МассивСубконто.Количество()>0 Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыСубконто",МассивСубконто);
	КонецЕсли;
	Для Каждого СтрокаОтбор Из Отбор Цикл
		Если СтрокаОтбор.ВидСравнения.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		ТекстУсловия = "ПараметрОтбора"+Строка(Отбор.Индекс(СтрокаОтбор));
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ТекстУсловия,СтрокаОтбор.Значение);
	КонецЦикла;
	
		
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТекстНачальноеСальдо",фин_УправлениеОтчетамиБюджетирование.ПредставлениеПоляСтрокойНаЯзыке("СальдоНаНачало",ЯзыкОтчета));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТекстОбороты",фин_УправлениеОтчетамиБюджетирование.ПредставлениеПоляСтрокойНаЯзыке("Оборот",ЯзыкОтчета));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТекстКонечноеСальдо",фин_УправлениеОтчетамиБюджетирование.ПредставлениеПоляСтрокойНаЯзыке("СальдоНаКонец",ЯзыкОтчета));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Периодичность",ПериодичностьОтчета);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Счет",Счет);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Сценарий",Сценарий);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",НачалоПериода);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода",КонецДня(КонецПериода));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЯзыкОтчета",ЯзыкОтчета);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПоСубсчетам",ПоСубсчетам);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПоКорсчетам",ПоКорсчетам);
	Если МассивСубконто.Количество()>0 Тогда
		СписокСубконто = Новый СписокЗначений;
		СписокСубконто.ЗагрузитьЗначения(МассивСубконто);
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыСубконто",СписокСубконто);
	КонецЕсли;
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Очистить();
	
	ПолеСчет = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ПолеСчет.Использование = Истина;
	ПолеРазрезаАналитики=ПолеСчет.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеРазрезаАналитики.Использование	= Истина;
	ПолеРазрезаАналитики.Поле			= Новый ПолеКомпоновкиДанных("Счет");
	ПолеРазрезаАналитики.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
	ВыбранныеПоляДляТекущей=ПолеСчет.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ВыбранныеПоляДляТекущей.Использование=Истина;
	
	Порядок = ПолеСчет.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	Порядок.Использование = Истина;
	Порядок.Поле = Новый ПолеКомпоновкиДанных("Счет");
	Порядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
	ПолеСчет.ПараметрыВывода.Элементы.Найти("РасположениеИтогов").Использование = Истина;
	ПолеСчет.ПараметрыВывода.Элементы.Найти("РасположениеИтогов").Значение = РасположениеИтоговКомпоновкиДанных.Нет;
	
	ПолеСчет.ПараметрыВывода.Элементы.Найти("РасположениеГруппировки").Использование = Истина;
	ПолеСчет.ПараметрыВывода.Элементы.Найти("РасположениеГруппировки").Значение = РасположениеГруппировкиКомпоновкиДанных.НачалоИКонец;
	
	ПолеСчет.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов").Использование = Истина;
	ПолеСчет.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов").Значение = РасположениеИтоговКомпоновкиДанных.Нет;

	РодительскаяГруппировка = ПолеСчет;
	
	Если ЗначениеЗаполнено(ПериодичностьОтчета) Тогда
		ПолеПериод = РодительскаяГруппировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ПолеПериод.Использование = Истина;
		ПолеРазрезаАналитики=ПолеПериод.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеРазрезаАналитики.Использование	= Истина;
		ПолеРазрезаАналитики.Поле			= Новый ПолеКомпоновкиДанных("Период");
		ПолеРазрезаАналитики.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
		ВыбранныеПоляДляТекущей=ПолеПериод.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		ВыбранныеПоляДляТекущей.Использование=Истина;
		
		Порядок = ПолеПериод.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		Порядок.Использование = Истина;
		Порядок.Поле = Новый ПолеКомпоновкиДанных("Период");
		Порядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
		ПолеПериод.ПараметрыВывода.Элементы.Найти("РасположениеИтогов").Использование = Истина;
		ПолеПериод.ПараметрыВывода.Элементы.Найти("РасположениеИтогов").Значение = РасположениеИтоговКомпоновкиДанных.Нет;
		
		ПолеПериод.ПараметрыВывода.Элементы.Найти("РасположениеГруппировки").Использование = Истина;
		ПолеПериод.ПараметрыВывода.Элементы.Найти("РасположениеГруппировки").Значение = РасположениеГруппировкиКомпоновкиДанных.НачалоИКонец;
		
		ПолеПериод.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов").Использование = Истина;
		ПолеПериод.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов").Значение = РасположениеИтоговКомпоновкиДанных.Нет;

		РодительскаяГруппировка = ПолеПериод;
	КонецЕсли;
	
	Для Каждого Поле Из ГруппировочныеПоля Цикл
		СхемаКомпоновкиДанных.НаборыДанных["Остатки"].Поля.Найти(Поле).ВыражениеПредставления = "фин_УправлениеОтчетамиБюджетирование.ПредставлениеПоляСтрокойНаЯзыке("+Поле+",&ЯзыкОтчета)";
		СхемаКомпоновкиДанных.НаборыДанных["Обороты"].Поля.Найти(Поле).ВыражениеПредставления = "фин_УправлениеОтчетамиБюджетирование.ПредставлениеПоляСтрокойНаЯзыке("+Поле+",&ЯзыкОтчета)";
		
		ПолеСубконто = РодительскаяГруппировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ПолеСубконто.Использование = Истина;
		ПолеРазрезаАналитики=ПолеСубконто.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеРазрезаАналитики.Использование	= Истина;
		ПолеРазрезаАналитики.Поле			= Новый ПолеКомпоновкиДанных(Поле);
		//ПолеСубконто.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
		ВыбранныеПоляДляТекущей=ПолеСубконто.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		ВыбранныеПоляДляТекущей.Использование=Истина;
		
		Порядок = ПолеСубконто.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		Порядок.Использование = Истина;
		Порядок.Поле = Новый ПолеКомпоновкиДанных(Поле);
		Порядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
		ПолеСубконто.ПараметрыВывода.Элементы.Найти("РасположениеИтогов").Использование = Истина;
		ПолеСубконто.ПараметрыВывода.Элементы.Найти("РасположениеИтогов").Значение = РасположениеИтоговКомпоновкиДанных.Нет;
		
		ПолеСубконто.ПараметрыВывода.Элементы.Найти("РасположениеГруппировки").Использование = Истина;
		ПолеСубконто.ПараметрыВывода.Элементы.Найти("РасположениеГруппировки").Значение = РасположениеГруппировкиКомпоновкиДанных.НачалоИКонец;
		
		ПолеСубконто.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов").Использование = Истина;
		ПолеСубконто.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов").Значение = РасположениеИтоговКомпоновкиДанных.Нет;

		РодительскаяГруппировка = ПолеСубконто;
	КонецЦикла;
	
	Если ПоКорСчетам Тогда
		ПолеКорсчет = РодительскаяГруппировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ПолеКорсчет.Использование = Истина;
		ПолеРазрезаАналитики=ПолеКорсчет.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеРазрезаАналитики.Использование	= Истина;
		ПолеРазрезаАналитики.Поле			= Новый ПолеКомпоновкиДанных("КорСчет");
		//ПолеРазрезаАналитики.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
		ВыбранныеПоляДляТекущей=ПолеКорсчет.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		ВыбранныеПоляДляТекущей.Использование=Истина;
		
		Порядок = ПолеКорсчет.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		Порядок.Использование = Истина;
		Порядок.Поле = Новый ПолеКомпоновкиДанных("КорСчет");
		Порядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
		ПолеКорсчет.ПараметрыВывода.Элементы.Найти("РасположениеПолейГруппировки").Использование = Истина;
		ПолеКорсчет.ПараметрыВывода.Элементы.Найти("РасположениеПолейГруппировки").Значение = РасположениеПолейГруппировкиКомпоновкиДанных.Вместе;
		
		//Отбор = ПолеКорсчет.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//Отбор.Использование = Истина;
		//Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Порядок");
		//Отбор.ПравоеЗначение = 2;
		ПолеКорсчет.ПараметрыВывода.Элементы.Найти("ВыводитьОтбор").Использование = Истина;
		ПолеКорсчет.ПараметрыВывода.Элементы.Найти("ВыводитьОтбор").Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
		
		РодительскаяГруппировка = ПолеКорсчет;
	КонецЕсли;
	
	Если ПоКорСубконто Тогда
		Для Инд = 1 По фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("МаксимальноеКоличествоСубконто") Цикл
			ПолеКорСубконто = РодительскаяГруппировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			ПолеКорСубконто.Использование = Истина;
			ПолеРазрезаАналитики=ПолеКорСубконто.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеРазрезаАналитики.Использование	= Истина;
			ПолеРазрезаАналитики.Поле			= Новый ПолеКомпоновкиДанных("КорСубконто"+Строка(Инд));
			//ПолеРазрезаАналитики.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
			ВыбранныеПоляДляТекущей=ПолеКорСубконто.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			ВыбранныеПоляДляТекущей.Использование=Истина;
			
			Порядок = ПолеКорСубконто.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			Порядок.Использование = Истина;
			Порядок.Поле = Новый ПолеКомпоновкиДанных("КорСубконто"+Строка(Инд));
			Порядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		
			ПолеКорСубконто.ПараметрыВывода.Элементы.Найти("РасположениеПолейГруппировки").Использование = Истина;
			ПолеКорСубконто.ПараметрыВывода.Элементы.Найти("РасположениеПолейГруппировки").Значение = РасположениеПолейГруппировкиКомпоновкиДанных.Вместе;
			
			//Отбор = ПолеКорСубконто.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			//Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			//Отбор.Использование = Истина;
			//Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Порядок");
			//Отбор.ПравоеЗначение = 2;
			ПолеКорСубконто.ПараметрыВывода.Элементы.Найти("ВыводитьОтбор").Использование = Истина;
			ПолеКорСубконто.ПараметрыВывода.Элементы.Найти("ВыводитьОтбор").Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
			
			РодительскаяГруппировка = ПолеКорСубконто;
		КонецЦикла;
	КонецЕсли;
	
	
	//ПОДГОТОВКА К ВЫПОЛНЕНИЮ - ФОРМИРОВАНИЕ МАКЕТА КОМПОНОВКИ
	КомпоновщикМакета=Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	Попытка
		МакетКомпоновки=КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.Настройки,ДанныеРасшифровки);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	//СхемаКомпоновкиДанных.НаборыДанных.Основной.Поля.Найти("Период").ВыражениеПредставления="фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(Период,"""+Периодичность+""")";
	
	//ВЫПОЛНЕНИЕ КОМПОНОВКИ ДАННЫХ
	ПроцессорКомпоновки=Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки,Истина);
	
	//ВЫВОД РЕЗУЛЬТАТА В ТАБЛИЧНЫЙ ДОКУМЕНТ
	ДокументРезультат.Очистить();
	ПроцессорВывода=Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.ОтображатьПроцентВывода=Истина;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//инициализация начала вывода
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки,Истина);
	Макет = ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Заголовок");
	Для Каждого Элемент Из Метаданные.Перечисления.фин_РесурсыДанныхБюджетирования.ЗначенияПеречисления Цикл
		Область.Параметры[Элемент.Имя]=фин_УправлениеОтчетамиБюджетирование.ПредставлениеПоляСтрокойНаЯзыке(Элемент.Имя,ЯзыкОтчета);
	КонецЦикла;
	Область.Параметры["Дебет"]=фин_УправлениеОтчетамиБюджетирование.ПредставлениеПоляСтрокойНаЯзыке("Дебет",ЯзыкОтчета);
	Область.Параметры["Кредит"]=фин_УправлениеОтчетамиБюджетирование.ПредставлениеПоляСтрокойНаЯзыке("Кредит",ЯзыкОтчета);
	Область.Параметры["Счет"]=фин_УправлениеОтчетамиБюджетирование.ПредставлениеПоляСтрокойНаЯзыке("Счет",ЯзыкОтчета);
	Область.Параметры["Период"]=фин_УправлениеОтчетамиБюджетирование.ПредставлениеПоляСтрокойНаЯзыке("Период",ЯзыкОтчета);
	Область.Параметры["КорСчет"]=фин_УправлениеОтчетамиБюджетирование.ПредставлениеПоляСтрокойНаЯзыке("КорСчет",ЯзыкОтчета);
	Область.Параметры["КорСубконто"]=фин_УправлениеОтчетамиБюджетирование.ПредставлениеПоляСтрокойНаЯзыке("КорСубконто",ЯзыкОтчета);
	ДокументРезультат.ВставитьОбласть(Область.Область("R1:R3"),ДокументРезультат.Область("R1:R3"),ТипСмещенияТабличногоДокумента.ПоВертикали,Истина);
	Для Инд=1 По 10 Цикл                                      
		ДокументРезультат.Область("R1C"+Строка(Инд)+":R3C"+Строка(Инд)).ШиринаКолонки = ДокументРезультат.Область("R4C"+Строка(Инд)+":R4C"+Строка(Инд)).ШиринаКолонки;
	КонецЦикла;
	Если Показатели.НайтиСтроки(Новый Структура("Показатель",Перечисления.фин_РесурсыДанныхБюджетирования.Количество)).Количество()=0 Тогда
		ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область("C9:C10"));
		ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область("R1C9:R3C10"));
	КонецЕсли;
	Если Показатели.НайтиСтроки(Новый Структура("Показатель",Перечисления.фин_РесурсыДанныхБюджетирования.ВалютнаяСумма)).Количество()=0 Тогда
		ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область("C7:C8"));
		ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область("R1C7:R3C8"));
	КонецЕсли;
	Если Показатели.НайтиСтроки(Новый Структура("Показатель",Перечисления.фин_РесурсыДанныхБюджетирования.СуммаСценария)).Количество()=0 Тогда
		ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область("C5:C6"));
		ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область("R1C5:R3C6"));
	КонецЕсли;
	Если Показатели.НайтиСтроки(Новый Структура("Показатель",Перечисления.фин_РесурсыДанныхБюджетирования.СуммаУпр)).Количество()=0 Тогда
		ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область("C3:C4"));
		ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область("R1C3:R3C4"));
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьСпискиПоказателейИГруппировок() Экспорт
	ДоступныеПоказатели = Новый СписокЗначений;
	Если Счет.Количественный Тогда
		ДоступныеПоказатели.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.Количество);
	КонецЕсли;
	Если Счет.Валютный Тогда
		ДоступныеПоказатели.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.ВалютнаяСумма);
	КонецЕсли;
	ДоступныеПоказатели.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.СуммаСценария);
	ДоступныеПоказатели.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.СуммаУпр);
	ДоступныеГруппировки = Новый СписокЗначений;
	Для Каждого СтрокаСубконто Из Счет.ВидыСубконто Цикл
		Измерение = фин_РаботаСДополнительнымиРазрезамиБюджетирования.ИзмерениеПоРазрезу(СтрокаСубконто.ВидСубконто);
		ДоступныеГруппировки.Добавить(Измерение,фин_РаботаСДополнительнымиРазрезамиБюджетирования.ПредставлениеРазреза(Измерение));
	КонецЦикла;
	//Если ЗначениеЗаполнено(ПериодичностьОтчета) Тогда
	//	ДоступныеГруппировки.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.ПериодПланирования,"Период группировки");
	//КонецЕсли;
	ДоступныеГруппировки.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.Валюта,"Валюта операции");
	ДоступныеГруппировки.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.Организация,"Организация");
КонецПроцедуры

Функция ТекстЗапросаОстатки(ТекстФильтрОстатки,МассивВидовСубконто,ДополнительныеПоля)
	ТекстПоля = "";
	Для Каждого Поле Из ДополнительныеПоля Цикл
		Если Найти(Поле,"Субконто")=0 Тогда
			Продолжить;
		КонецЕсли;
		ТекстПоля = ТекстПоля+",
		|	Обороты."+Поле;
	КонецЦикла;
	Текст = "ВЫБРАТЬ
|	Обороты.Счет,
|	Обороты.Валюта,
|	Обороты.Организация,
|	Обороты.Период КАК Период,
|	Обороты.КоличествоНачальныйОстатокДт,
|	Обороты.КоличествоНачальныйОстатокКт,
|	Обороты.КоличествоКонечныйОстатокДт,
|	Обороты.КоличествоКонечныйОстатокКт,
|	Обороты.КоличествоОборотДт,
|	Обороты.КоличествоОборотКт,
|	Обороты.СуммаУпрНачальныйОстатокДт,
|	Обороты.СуммаУпрНачальныйОстатокКт,
|	Обороты.СуммаУпрКонечныйОстатокДт,
|	Обороты.СуммаУпрКонечныйОстатокКт,
|	Обороты.СуммаУпрОборотДт,
|	Обороты.СуммаУпрОборотКт,
|	Обороты.ВалютнаяСуммаНачальныйОстатокДт,
|	Обороты.ВалютнаяСуммаНачальныйОстатокКт,
|	Обороты.ВалютнаяСуммаКонечныйОстатокДт,
|	Обороты.ВалютнаяСуммаКонечныйОстатокКт,
|	Обороты.ВалютнаяСуммаОборотДт,
|	Обороты.ВалютнаяСуммаОборотКт,
|	Обороты.СуммаСценарияНачальныйОстатокДт,
|	Обороты.СуммаСценарияНачальныйОстатокКт,
|	Обороты.СуммаСценарияКонечныйОстатокДт,
|	Обороты.СуммаСценарияКонечныйОстатокКт,
|	Обороты.СуммаСценарияОборотДт,
|	Обороты.СуммаСценарияОборотКт"+ТекстПоля+"
|ПОМЕСТИТЬ ВТ_Остатки
|ИЗ
|	(ВЫБРАТЬ
|		ВЫБОР
|			КОГДА &ПоСубСчетам
|				ТОГДА Обороты.Счет
|			ИНАЧЕ &Счет
|		КОНЕЦ КАК Счет,
|		Обороты.Валюта КАК Валюта,
|		Обороты.Организация КАК Организация,
|		"+?(ЗначениеЗаполнено(ПериодичностьОтчета),"Обороты.Период","ДАТАВРЕМЯ(1,1,1)")+" КАК Период,
|		Обороты.КоличествоНачальныйОстатокДт КАК КоличествоНачальныйОстатокДт,
|		Обороты.КоличествоНачальныйОстатокКт КАК КоличествоНачальныйОстатокКт,
|		Обороты.КоличествоКонечныйОстатокДт КАК КоличествоКонечныйОстатокДт,
|		Обороты.КоличествоКонечныйОстатокКт КАК КоличествоКонечныйОстатокКт,
|		Обороты.КоличествоОборотДт КАК КоличествоОборотДт,
|		Обороты.КоличествоОборотКт КАК КоличествоОборотКт,
|		Обороты.СуммаУпрНачальныйОстатокДт КАК СуммаУпрНачальныйОстатокДт,
|		Обороты.СуммаУпрНачальныйОстатокКт КАК СуммаУпрНачальныйОстатокКт,
|		Обороты.СуммаУпрКонечныйОстатокДт КАК СуммаУпрКонечныйОстатокДт,
|		Обороты.СуммаУпрКонечныйОстатокКт КАК СуммаУпрКонечныйОстатокКт,
|		Обороты.СуммаУпрОборотДт КАК СуммаУпрОборотДт,
|		Обороты.СуммаУпрОборотКт КАК СуммаУпрОборотКт,
|		Обороты.ВалютнаяСуммаНачальныйОстатокДт КАК ВалютнаяСуммаНачальныйОстатокДт,
|		Обороты.ВалютнаяСуммаНачальныйОстатокКт КАК ВалютнаяСуммаНачальныйОстатокКт,
|		Обороты.ВалютнаяСуммаКонечныйОстатокДт КАК ВалютнаяСуммаКонечныйОстатокДт,
|		Обороты.ВалютнаяСуммаКонечныйОстатокКт КАК ВалютнаяСуммаКонечныйОстатокКт,
|		Обороты.ВалютнаяСуммаОборотДт КАК ВалютнаяСуммаОборотДт,
|		Обороты.ВалютнаяСуммаОборотКт КАК ВалютнаяСуммаОборотКт,
|		Обороты.СуммаСценарияНачальныйОстатокДт КАК СуммаСценарияНачальныйОстатокДт,
|		Обороты.СуммаСценарияНачальныйОстатокКт КАК СуммаСценарияНачальныйОстатокКт,
|		Обороты.СуммаСценарияКонечныйОстатокДт КАК СуммаСценарияКонечныйОстатокДт,
|		Обороты.СуммаСценарияКонечныйОстатокКт КАК СуммаСценарияКонечныйОстатокКт,
|		Обороты.СуммаСценарияОборотДт КАК СуммаСценарияОборотДт,
|		Обороты.СуммаСценарияОборотКт КАК СуммаСценарияОборотКт"+ТекстПоля+"
|	ИЗ
|		РегистрБухгалтерии.фин_Бюджетирование.ОстаткиИОбороты(&НачалоПериода, &КонецПериода,"+?(ЗначениеЗаполнено(ПериодичностьОтчета),Строка(ПериодичностьОтчета),"")+", , Счет В ИЕРАРХИИ (&Счет),"+?(МассивВидовСубконто.Количество()=0,"","&ВидыСубконто")+", Сценарий = &Сценарий"+?(ТекстФильтрОстатки="",""," И "+ТекстФильтрОстатки)+") КАК Обороты) КАК Обороты
|;
| ВЫБРАТЬ
|	Обороты.Счет,
|	Обороты.Организация,
|	Обороты.Валюта,
|	Обороты.Период КАК Период,
|	Обороты.КоличествоНачальныйОстатокДт,
|	Обороты.КоличествоНачальныйОстатокКт,
|	Обороты.КоличествоКонечныйОстатокДт,
|	Обороты.КоличествоКонечныйОстатокКт,
|	Обороты.КоличествоОборотДт,
|	Обороты.КоличествоОборотКт,
|	Обороты.СуммаУпрНачальныйОстатокДт,
|	Обороты.СуммаУпрНачальныйОстатокКт,
|	Обороты.СуммаУпрКонечныйОстатокДт,
|	Обороты.СуммаУпрКонечныйОстатокКт,
|	Обороты.СуммаУпрОборотДт,
|	Обороты.СуммаУпрОборотКт,
|	Обороты.ВалютнаяСуммаНачальныйОстатокДт,
|	Обороты.ВалютнаяСуммаНачальныйОстатокКт,
|	Обороты.ВалютнаяСуммаКонечныйОстатокДт,
|	Обороты.ВалютнаяСуммаКонечныйОстатокКт,
|	Обороты.ВалютнаяСуммаОборотДт,
|	Обороты.ВалютнаяСуммаОборотКт,
|	Обороты.СуммаСценарияНачальныйОстатокДт,
|	Обороты.СуммаСценарияНачальныйОстатокКт,
|	Обороты.СуммаСценарияКонечныйОстатокДт,
|	Обороты.СуммаСценарияКонечныйОстатокКт,
|	Обороты.СуммаСценарияОборотДт,
|	Обороты.СуммаСценарияОборотКт"+ТекстПоля+"
|ИЗ ВТ_Остатки КАК Обороты
|";
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаОбороты(ТекстФильтрОстатки,МассивВидовСубконто,ДополнительныеПоля)
	ТекстПоля = "";
	Для Каждого Поле Из ДополнительныеПоля Цикл
		Если Найти(Поле,"Субконто")=0 Тогда
			Продолжить;
		КонецЕсли;
		ТекстПоля = ТекстПоля+",
		|	Обороты."+Поле;
	КонецЦикла;
	Текст = "ВЫБРАТЬ
|	Обороты.Счет,
|	Обороты.КорСчет,
|	Обороты.КорСубконто1,
|	Обороты.КорСубконто2,
|	Обороты.КорСубконто3,
|	Обороты.КорСубконто4,
|	Обороты.КорСубконто5,
|	Обороты.Валюта,
|	Обороты.КоличествоДт,
|	Обороты.КоличествоКт,
|	Обороты.СуммаУпрДт,
|	Обороты.СуммаУпрКт,
|	Обороты.ВалютнаяСуммаДт,
|	Обороты.ВалютнаяСуммаКт,
|	Обороты.СуммаСценарияДт,
|	Обороты.СуммаСценарияКт,
|	Обороты.Период,
|	Обороты.Организация"+ТекстПоля+"
|ИЗ
|	(ВЫБРАТЬ
|		ВЫБОР
|			КОГДА &ПоСубСчетам
|				ТОГДА Обороты.Счет
|			ИНАЧЕ &Счет
|		КОНЕЦ КАК Счет,
|		Обороты.КорСчет КАК КорСчет,
|		Обороты.КорСубконто1 КАК КорСубконто1,
|		Обороты.КорСубконто2 КАК КорСубконто2,
|		Обороты.КорСубконто3 КАК КорСубконто3,
|		Обороты.КорСубконто4 КАК КорСубконто4,
|		Обороты.КорСубконто5 КАК КорСубконто5,
|		Обороты.Валюта КАК Валюта,
|		Обороты.КоличествоОборотДт КАК КоличествоДт,
|		Обороты.КоличествоОборотКт КАК КоличествоКт,
|		Обороты.СуммаУпрОборотДт КАК СуммаУпрДт,
|		Обороты.СуммаУпрОборотКт КАК СуммаУпрКт,
|		Обороты.ВалютнаяСуммаОборотДт КАК ВалютнаяСуммаДт,
|		Обороты.ВалютнаяСуммаОборотКт КАК ВалютнаяСуммаКт,
|		Обороты.СуммаСценарияОборотДт КАК СуммаСценарияДт,
|		Обороты.СуммаСценарияОборотКт КАК СуммаСценарияКт,
|		"+?(ЗначениеЗаполнено(ПериодичностьОтчета),"Обороты.Период","ДАТАВРЕМЯ(1,1,1)")+" КАК Период,
|		Обороты.Организация КАК Организация"+ТекстПоля+"
|	ИЗ
|		РегистрБухгалтерии.фин_Бюджетирование.Обороты(&НачалоПериода, &КонецПериода,"+?(ЗначениеЗаполнено(ПериодичностьОтчета),Строка(ПериодичностьОтчета),"")+"  , Счет В ИЕРАРХИИ (&Счет),"+?(МассивВидовСубконто.Количество()=0,"","&ВидыСубконто")+", Сценарий = &Сценарий "+?(ТекстФильтрОстатки="",""," И "+ТекстФильтрОстатки)+", , ) КАК Обороты) КАК Обороты";
	Возврат Текст;
КонецФункции

ДоступныеПоказатели = Новый СписокЗначений;
ДоступныеГруппировки = Новый СписокЗначений;
ПереченьОсновныхРеквизитов = Новый Массив;
ПереченьОсновныхРеквизитов.Добавить("Счет");
//ПереченьОсновныхРеквизитов.Добавить("ПериодичностьОтчета");
ЗаполнениеПараметров = Новый Структура;
ЗаполнениеПараметров.Вставить("НачалоПериода",НачалоМесяца(ТекущаяДата()));
ЗаполнениеПараметров.Вставить("ЯзыкОтчета",фин_ОбщегоНазначенияСервер.ОсновнойЯзыкОтчетов());
ЗаполнениеПараметров.Вставить("КонецПериода",КонецМесяца(ТекущаяДата()));

ДополнительныеПараметры = Новый Массив;
ДополнительныеПараметры.Добавить("ЯзыкОтчета");

ПараметрыОформления = Новый Массив;

ДанныеРасшифровкиМакета = Новый Соответствие;

КЭШ = Новый Соответствие;

ДополнительныеПредставления = Новый СписокЗначений;
ДополнительныеПредставления.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.ФинансовыйПоказатель,"Счет");

ОтборыРасшифровки = Новый Массив;

ТаблицаОтбора = Новый ТаблицаЗначений;
ТаблицаОтбора.Колонки.Добавить("Поле");
ТаблицаОтбора.Колонки.Добавить("ВидСравнения");
ТаблицаОтбора.Колонки.Добавить("Значение");
